Repository: adslbarxatov/DPModule
Catalog: src/ESHQInstaller_*.resx
Languages: ru_ru

# AbortButtonText
source: &Cancel
ru_ru: &Отмена

# ArchiveAccessError
source: Cannot create or access package file
ru_ru: Не удалось создать или прочитать установочный пакет

# ArchiveDamagedError
source: Package file is missing, damaged or incorrect
ru_ru: Установочный пакет повреждён или некорректен

# ArchiveReadError
source: Cannot access package file
ru_ru: Не удалось прочитать установочный пакет

# ArchiveReadError_Update
source: (contains installation script)
ru_ru: (содержит сценарий установки)

# BackButtonText
source: < &Back
ru_ru: < &Назад

# BuildRadioText
source: Build package: allows creation of updates
ru_ru: Собрать пакет: создание пакета обновлений

# CompletedSuccessfully
source: Operation completed successfully
ru_ru: Операция успешно завершена

# CompletedUnsuccessfully
source: Operation completed unsuccessfully
ru_ru: Операция завершена с ошибкой

# CorrectPackage
source: Your deployment package is correct and up to date
ru_ru: Ваш установочный пакет корректен и актуален

# DisclaimerMainText
source: You can improve the app or view our other projects (just click the banner of interest). If you have any wishes, advices or troubles with this utility, remind us, using “Ask developer” button in the “About” window (available in tray icon’s menu)
ru_ru: Вы можете улучшить программу и ознакомиться с другими проектами (просто нажмите на интересующий баннер). При возникновении проблем с утилитой сообщите нам здесь или здесь

# ExitButtonText
source: E&xit
ru_ru: В&ыход

# FilesAccessError
source: Cannot access one or more source file(s)
ru_ru: Не удалось прочитать один или несколько исходных файлов

# FilesCreationError
source: Cannot create or access one or more file(s) or directory(ies)
ru_ru: Не удалось создать один или несколько файлов или директорий

# FilesSizeError
source: One or more source file(s) is/are too large
ru_ru: Один или несколько исходных файлов слишком велики

# IncorrectPackage
source: Your deployment package is not original! We strongly recommend against using it! Launch DPModule again and download the original deployment package
ru_ru: Ваш установочный пакет не является оригинальным! Мы настоятельно не рекомендуем его использование! Загрузите оригинальный установочный пакет: щёлкните правой кнопкой мыши по этому значку и откройте страницу обновлений

# InstallRadioText_Main
source: Install: allows application setup or recover
ru_ru: Установка: развёртка / восстановление программы

# InstallRadioText_Update
source: Install: allows update package applying
ru_ru: Установка: применение пакета обновлений

# LogCreationError
source: Failed to create installation log
ru_ru: Не удалось создать лог установки

# ModDBIsNotFullyAvailable
source: Project webpage is not fully available for now. Try again later
ru_ru: Сайт проекта в настоящий момент доступен неполностью. Повторите попытку позже

# ModDBIsUnavailable
source: Project webpage is unavailable for now. Try again later
ru_ru: Сайт проекта в настоящий момент недоступен. Повторите попытку позже

# ModeLabelText_Main
source: Select mode:
ru_ru: Выберите режим установки:

# ModPath
source: Application’s installation path:
ru_ru: Путь установки программы:

# NextButtonText
source: &Next >
ru_ru: &Далее >

# OperationInterrupted
source: Operation interrupted by user
ru_ru: Операция прервана пользователем

# PackageChecking
source: Checking deployment package. Please, wait...
ru_ru: Проверка установочного пакета. Пожалуйста, подождите...

# PathDoesntExist
source: The specified directory doesn’t exist. You may be trying to update or uninstall a product that has never been installed or has already been removed
ru_ru: Указанная директория не существует

# ReadyMessage1
source: We are ready for
ru_ru: Мы готовы к

# ReadyMessage2_Install
source: application installation at “{0:S}”
ru_ru: установке программы в «{0:S}»

# ReadyMessage2_Rebuild
source: package rebuilding.
ru_ru: перестроению пакета.

# ReadyMessage2_Uninstall
source: application removing from “{0:S}”
ru_ru: удалению программы из «{0:S}»

# ReadyMessage2_Update
source: updating installation at “{0:S}”
ru_ru: обновлению программы в «{0:S}»

# ReadyMessage3
source: Press “Next” to continue. Operation can take about 5 minutes
ru_ru: Нажмите «Далее» для продолжения. Операция может занять до 5 минут

# RegistryKeyNotFound
source: Application’s installation path not found in registry. Most likely this product has not been installed on this PC before. If this is not the case, use “Restore package’s deployment path” option in tray icon’s menu
ru_ru: Путь установки программы не найден в реестре. Используйте ключ командной строки /r для его восстановления. ВНИМАНИЕ: указание некорректного пути может привести к повреждению важных файлов!

# SpecifyModPath
source: Specify installation path:
ru_ru: Укажите путь установки программы:

# UninstallRadioText
source: Uninstall: allows application remove
ru_ru: Удаление: деинсталляция программы

# UpdateMessage1_Update
source: Update to v {0:S}
ru_ru: Обновление до версии {0:S} доступно

# UpdateMessage2
source: available for download. Launch DPModule again to download it
ru_ru: для загрузки. Щёлкните правой кнопкой мыши по этому значку и откройте страницу обновлений для продолжения

# UpdatesChecking
source: Checking for updates...
ru_ru: Проверка обновлений...

# VersionUnavailable
source: <unavailable>
ru_ru: <недоступна>

# AlreadyStarted
source: {0:S} is already started
ru_ru: уже запущена

# PathRestoreText
source: This function will restore registry entry required by deployment module. You must specify correct path to application’s installation directory in the next window (f. e., {0:S}\{1:S}\). NOTE: if you’ll set incorrect path, updater and installer may damage valuable files!
ru_ru: Вас приветствует {0:S}! Эта функция восстановит запись в реестре, требующуюся для работы установочного модуля. Вы должны указать корректный путь к директории, в которую была установлена программа, в следующем окне (f. e., {1:S}\{2:S}\). ВНИМАНИЕ: указание некорректного пути может привести к повреждению важных файлов!

# LanguageSelectorMessage
source: Current interface language is {0:S}. Select new language:
ru_ru: Текущий язык интерфейса – {0:S}. Выберите новый язык:

# SelectPackage
source: Select all packages that you want to deploy
ru_ru: Выберите все пакеты, которые необходимо развернуть

# IconMenuShowAbout
source: Actual package’s version info
ru_ru: Информация об актуальной версии пакета

# HelpText
source: DPModule – deployment packages module for RD AAOW Free development lab’s projects The tool performs installation, uninstallation, updates checking and packages downloading for our products. Since v 10, this tool is the only thing you need to start working with our developments
ru_ru: Модуль развёртки для проектов RD AAOW FUPL. Инструмент выполняет установку / удаление / сборку / проверку обновлений для наших продуктов

# PackagesListUnavailable
source: Deployment packages list is unavailable. Check your internet connection If the reason is the blocking of the GitHub platform in your country, please contact the official channels of the Lab for more information (activate tray icon’s menu, click “About DPModule”, select a convenient channel and click “▶”)
ru_ru: Список установочных пакетов недоступен. Проверьте ваше интернет-подключение

# PackagesListChecking
source: Downloading packages list...
ru_ru: Загрузка списка пакетов...

# PackageDownload
source: Downloading deployment package:
ru_ru: Загрузка установочного пакета...

# PackageFailure
source: Failed to download deployment package. Check your internet connection
ru_ru: Не удалось загрузить установочный пакет. Проверьте ваше интернет-подключение

# PackageSuccess
source: Success!
ru_ru: Успешно!

# PackageUnzipFailure
source: Cannot unpack downloaded archive automatically. Open it for manual extracting?
ru_ru: Не удалось автоматически распаковать загруженный архив. Открыть его для ручного извлечения?
